backend-clicktrip/app/controllers/activity_bookings_controller.rb

    def index
        @activity_bookings = ActivityBooking.all
---
SELECT "activity_bookings".* FROM "activity_bookings"