backend-clicktrip/app/controllers/activities_controller.rb

    def create
        activity = Activity.new(activity_params)

        if activity.save
---
INSERT INTO "activities" ("trip_id", "name", "open_time", "close_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["trip_id", 5], ["name", "Connolley's Bar"], ["open_time", "10:00:00"], ["close_time", "04:00:00"], ["created_at", "2020-04-09 17:58:37.511903"], ["updated_at", "2020-04-09 17:58:37.511903"]]