backend-clicktrip/app/controllers/flights_controller.rb

    def create
        flight = Flight.new(flight_params)

        if flight.save
---
INSERT INTO "flights" ("trip_id", "departure_airport", "departure_time", "departure_date", "arrival_airport", "arrival_time", "arrival_date", "airline", "flight_num", "num_stops", "ticket_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"