backend-clicktrip/app/controllers/hotels_controller.rb

    def index
        @hotels = Hotel.all
---
SELECT "hotels".* FROM "hotels"

    def create
        hotel = Hotel.new(hotel_params)

        if hotel.save
---
INSERT INTO "hotels" ("trip_id", "address", "company", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["trip_id", 1], ["address", "333 Lucky Lane, Dublin, Ireland"], ["company", "Shamrock Inc"], ["created_at", "2020-04-09 16:53:50.306158"], ["updated_at", "2020-04-09 16:53:50.306158"]]