backend-clicktrip/app/controllers/trips_controller.rb

SELECT "trips".* FROM "trips"
---
    def index
        trips = Trip.all

SELECT "trips".* FROM "trips" WHERE "trips"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        trip = Trip.find(params[:id])

INSERT INTO "trips" ("user_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["user_id", 1], ["created_at", "2020-04-09 16:49:09.637753"], ["updated_at", "2020-04-09 16:49:09.637753"]]
---
    def create
        puts "create triggered!"
        puts "trip params:"
        puts trip_params
        trip = Trip.new(trip_params)
        if trip.save