backend-clicktrip/app/controllers/users_controller.rb

    def show
        @user = User.find(params[:id])
        @profile = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def my_trips
        puts params
        @user = User.find(params[:user_id])
        @trips = {trips: Trip.select{|trip| trip.user_id == @user.id}}
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "trips".* FROM "trips"